Repository: AleksanderNekr/Min-Api-Essential
Catalog: MinApiEssential/Resources/Resources.*.resx
Languages: ru

# ValidationErrorTitle
source: Validation errors occured
ru: Возникли ошибки валидации

# DefaultError
source: An unknown failure has occurred
ru: Возникла непредвиденная ошибка

# DuplicateEmail
source: Email '{0}' is already taken
ru: Адрес '{0}' уже занят

# DuplicateRoleName
source: Role name '{0}' is already taken
ru: Роль '{0}' уже занята

# DuplicateUserName
source: Username '{0}' is already taken
ru: Имя '{0}' уже занято

# InvalidEmail
source: Email '{0}' is invalid
ru: Адрес '{0}' имеет неверный формат

# InvalidManagerType
source: Type {0} must derive from {1}&lt;{2}&gt;
ru: Тип {0} должен происходить от {1}&lt;{2}&gt;

# InvalidPasswordHasherCompatibilityMode
source: The provided PasswordHasherCompatibilityMode is invalid
ru: Предоставленный режим совместимости хеширования пароля некорректен

# InvalidPasswordHasherIterationCount
source: The iteration count must be a positive integer
ru: Число итераций должно быть положительным

# InvalidRoleName
source: Role name '{0}' is invalid
ru: Роль '{0}' некорректна

source: Invalid token
ru: Токен некорректен

# InvalidUserName
source: Username '{0}' is invalid, can only contain letters or digits
ru: Имя '{0}' некорректно, может содержать только буквы или цифры

# LoginAlreadyAssociated
source: A user with this login already exists
ru: Пользователь с таким логином уже существует

# MustCallAddIdentity
source: AddIdentity must be called on the service collection
ru: AddIdentity должен быть вызван на коллекции сервисов

# NoTokenProvider
source: No IUserTwoFactorTokenProvider&lt;{0}&gt; named '{1}' is registered
ru: Не зарегистрировано ни одного IUserTwoFactorTokenProvider&lt;{0}&gt; с именем '{1}'

# NullSecurityStamp
source: User security stamp cannot be null
ru: Метка безопасности пользователя не может быть равна null

# PasswordMismatch
source: Incorrect password
ru: Неверный пароль

source: Passwords must have at least one digit ('0'-'9')
ru: Пароль должен содержать хотя бы одну цифру ('0'-'9')

# PasswordRequiresLower
source: Passwords must have at least one lowercase ('a'-'z')
ru: Пароль должен содержать хотя бы одну строчную букву ('a'-'z')

# PasswordRequiresNonAlphanumeric
source: Passwords must have at least one non alphanumeric character
ru: Пароль должен содержать хотя бы один небуквенно-цифровой символ

# PasswordRequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z')
ru: Пароль должен содержать хотя бы одну заглавную букву ('A'-'Z')

# PasswordTooShort
source: Passwords must be at least {0} characters
ru: Пароль должен состоять не менее чем из {0} символов

# RoleNotFound
source: Role {0} does not exist
ru: Роль {0} не существует

# StoreNotIQueryableRoleStore
source: Store does not implement IQueryableRoleStore&lt;TRole&gt;
ru: Хранилище не реализует IQueryableRoleStore&lt;TRole&gt;

# StoreNotIRoleClaimStore
source: Store does not implement IRoleClaimStore&lt;TRole&gt;
ru: Хранилище не реализует IRoleClaimStore&lt;TRole&gt;

# StoreNotIUserAuthenticationTokenStore
source: Store does not implement IUserAuthenticationTokenStore<User>
ru: Хранилище не реализует IUserAuthenticationTokenStore<User>

# StoreNotIUserClaimStore
source: Store does not implement IUserClaimStore<TUser>
ru: Хранилище не реализует IUserClaimStore<TUser>

# StoreNotIUserConfirmationStore
source: Store does not implement IUserConfirmationStore<TUser>
ru: Хранилище не реализует IUserConfirmationStore<TUser>

# StoreNotIUserEmailStore
source: Store does not implement IUserEmailStore<TUser>
ru: Хранилище не реализует IUserEmailStore<TUser>

# StoreNotIUserLockoutStore
source: Store does not implement IUserLockoutStore<TUser>
ru: Хранилище не реализует IUserLockoutStore<TUser>

# StoreNotIUserLoginStore
source: Store does not implement IUserLoginStore<TUser>
ru: Хранилище не реализует IUserLoginStore<TUser>

# StoreNotIUserPasswordStore
source: Store does not implement IUserPasswordStore<TUser>
ru: Хранилище не реализует IUserPasswordStore<TUser>

# StoreNotIUserPhoneNumberStore
source: Store does not implement IUserPhoneNumberStore<TUser>
ru: Хранилище не реализует IUserPhoneNumberStore<TUser>

# StoreNotIUserRoleStore
source: Store does not implement IUserRoleStore<TUser>
ru: Хранилище не реализует IUserRoleStore<TUser>

# StoreNotIUserSecurityStampStore
source: Store does not implement IUserSecurityStampStore<TUser>
ru: Хранилище не реализует IUserSecurityStampStore<TUser>

# StoreNotIUserAuthenticatorKeyStore
source: Store does not implement IUserAuthenticatorKeyStore<User>
ru: Хранилище не реализует IUserAuthenticatorKeyStore<User>

# StoreNotIUserTwoFactorStore
source: Store does not implement IUserTwoFactorStore<TUser>
ru: Хранилище не реализует IUserTwoFactorStore<TUser>

source: Recovery code redemption failed
ru: Не удалось использовать код восстановления

# UserAlreadyHasPassword
source: User already has a password set
ru: У пользователя уже установлен пароль

# UserAlreadyInRole
source: User already in role '{0}'
ru: Пользователь уже в роли '{0}'

# UserLockedOut
source: User is locked out
ru: Пользователь заблокирован

# UserLockoutNotEnabled
source: Lockout is not enabled for this user
ru: Блокировка не включена для этого пользователя

# UserNameNotFound
source: User {0} does not exist
ru: Пользователь {0} не существует

# UserNotInRole
source: User is not in role '{0}'
ru: Пользователь не в роли '{0}'

# StoreNotIUserTwoFactorRecoveryCodeStore
source: Store does not implement IUserTwoFactorRecoveryCodeStore<User>
ru: Хранилище не реализует IUserTwoFactorRecoveryCodeStore<User>

# PasswordRequiresUniqueChars
source: Passwords must use at least {0} different characters
ru: Пароли должны использовать не менее {0} различных символов

# NoRoleType
source: No RoleType was specified, try AddRoles<TRole>()
ru: Тип роли не указан, попробуйте AddRoles<TRole>()

# StoreNotIProtectedUserStore
source: Store does not implement IProtectedUserStore<TUser> which is required when ProtectPersonalData = true
ru: Хранилище не реализует IProtectedUserStore<TUser>, что необходимо при ProtectPersonalData = true

# NoPersonalDataProtector
source: No IPersonalDataProtector service was registered, this is required when ProtectPersonalData = true
ru: Служба IPersonalDataProtector не зарегистрирована, что необходимо при ProtectPersonalData = true

# PasswordRequiresDigit
source: Passwords must have at least one digit ('0'-'9')
ru: Пароль должен содержать хотя бы одну цифру ('0'-'9')

# ConcurrencyFailure
source: Optimistic concurrency failure, object has been modified
ru: Оптимистический сбой параллелизма, объект был изменен
